megalloid/STM32F0xx/Drivers/MY/Inc/my_stm32f0xx_gpio.h
/**
 * @author  Andrey Zaostrovnykh
 * @email   megalloid@mail.ru
 * @website http://smarthouseautomatics.ru/stm32/stm32f0xx/gpio
 * @version v0.1
 * @ide     STM32CubeIDE
 * @brief   Библиотека для работы с GPIO (без EXTI)
 */

#ifndef MY_STM32F0xx_GPIO_H
	#define MY_STM32F0xx_GPIO_H 100

	/* C++ detection */
	#ifdef __cplusplus
		extern "C"
		{
	#endif

	/**
	 * @addtogroup MY_STM32F0xx_Libraries
	 * @{
	 */
		/**
		 * @defgroup MY_HAL_GPIO
		 * @brief    Библиотека GPIO для STM32F0xx
		 *
		 * GPIO библиотека обеспечивает легкую инициализацию и управление GPIO
		 * Может использоваться в качестве замены STD/HAL драйверов GPIO

		 ==============================================================================
								##### Особенности GPIO #####
		 ==============================================================================

		 (+) Каждый выход порта ввода\вывода general-purpose I/O (GPIO) может быть отдельно сконфигурирован
		 	 с помощью программного обеспечения. Поддерживаются следующие режимы:
			(++) Input mode
			(++) Analog mode
			(++) Output mode
			(++) Alternate function mode
			(++) External interrupt/event lines (используется в отдельной библиотеке EXTi)

		 (+) После сброса микроконтроллера альтернативные функции и линии внешних прерываний не доступны и
		 	 порты сконфигурированы в режиме Input floating.

		 (+) Все пины GPIO имеют встроенные pull-up и pull-down резисторы, которые могут быть включены.

		 (+) В режиме Output или Alternate, каждый вход\выход может быть сконфигурирован в режим Open-drain или push-pull
		     Скорость работы входа\выхода может быть выбрана в зависимости от напряжения VDD.

		 (+) Пины внутри микроконтроллера подключаются к периферии/модулям через мультиплексор, который
		     позволяет подключать только одну альтернативную функцию для работы с переферией (AF) в момент времени.
		     Это позволяет избежать конфликта при использовании периферии.

		 ==============================================================================
						##### Как использовать эту бибилиотеку #####
		 ==============================================================================

		 (#) Включаем таткирование на GPIO AHB используя макрос из библиотеки RCC: MY_RCC_GPIOx_CLK_ENABLE().

		 (#) Настроить пины GPIO используя прямую передачу параметров через MY_GPIO_Init() или через структуру MY_GPIO_StructInit()

			(++) Настроить IO mode используя элемент "Mode" из структуры MY_GPIO_Init_t

			(++) Включить Pull-up, Pull-down резистор используя элемент "Pull" из структуры GPIO_Init_t.

			(++) В случае если активируется режим Output или alternate function: скорость работы порта
				 настраивается через элемент "Speed" структуры MY_GPIO_Init_t.

			(++) В режиме alternate mode конкретая периферия подключается через указание значения
				 элемента "Alternate" структуры MY_GPIO_Init_t.

			(++) Аналоговый режим необходим для использования ADC или DAC.

		 (#) MY_GPIO_DeInit позволяет сбросить регистры к значению по умолчанию.
		  	 Это рекомендуется делать в случае если пин переключается в режим external interrupt или в event mode.

		 (#) Для получения текущего уровня - нужно использовать функцию MY_GPIO_ReadPin().

		 (#) Для изменения состояния GPIO пина в режиме output используйте MY_GPIO_WritePin()/MY_GPIO_TogglePin().

		 (#) Для блокировки конфигурации до следующего сброса используйте MY_GPIO_LockPin().

		 (#) Сразу после сброса альтернативные функции пинов не активны и пины GPIO сконфигурированы в режиме input floating (за исключением JTAG пинов).

		 (#) Пины осциллятора LSE OSC32_IN и OSC32_OUT могут использоваться как пины общего назначения (PC14 и PC15).
			 Режим LSE имеет приоритете над функциями GPIO.

		 (#) Пины осциллятора HSE OSC_IN/OSC_OUT могут использоваться как пины общего назначения (PF0 и PF1).
			 Режим HSE имеет приоритете над функциями GPIO.

		*
		* @{
		*/
			/* Подключаем основные файлы библиотек и настройки проекта*/
			#include "main.h"
			#include "my_stm32f0xx.h"
			#include "my_stm32f0xx_rcc.h"
			#include "my_stm32f0xx_utils.h"


			/**
			 * @defgroup MY_GPIO_Settings
			 * @brief    Библиотечные настройки
			 * 			 Данные настройки используются по умолчанию если они не переобъявлены в настройках проекта или в файле main.h
			 * @{
			 */

			/**
			 * @} MY_GPIO_Settings
			 */


			/**
			 * @defgroup MY_GPIO_Defines
			 * @brief    Библиотечные констатны
			 * @{
			 */

				/**
				 * @brief Базовые константы библиотеки
				 */
				#define GPIO_MODE             (0x00000003U)
				#define GPIO_OUTPUT_TYPE      (0x00000010U)

				#define GPIO_NUMBER           (16U)

				/**
				 * @brief Объявление GPIO пинов
				 * @note  Для совместимости с библиотекой HAL
				 */
				#define GPIO_Pin_0						((uint16_t)0x0001)
				#define GPIO_Pin_1						((uint16_t)0x0002)
				#define GPIO_Pin_2						((uint16_t)0x0004)
				#define GPIO_Pin_3						((uint16_t)0x0008)
				#define GPIO_Pin_4						((uint16_t)0x0010)
				#define GPIO_Pin_5						((uint16_t)0x0020)
				#define GPIO_Pin_6						((uint16_t)0x0040)
				#define GPIO_Pin_7						((uint16_t)0x0080)
				#define GPIO_Pin_8						((uint16_t)0x0100)
				#define GPIO_Pin_9						((uint16_t)0x0200)
				#define GPIO_Pin_10						((uint16_t)0x0400)
				#define GPIO_Pin_11						((uint16_t)0x0800)
				#define GPIO_Pin_12						((uint16_t)0x1000)
				#define GPIO_Pin_13						((uint16_t)0x2000)
				#define GPIO_Pin_14						((uint16_t)0x4000)
				#define GPIO_Pin_15						((uint16_t)0x8000)
				#define GPIO_Pin_ALL					((uint16_t)0xFFFF)

				/**
				 * @brief Объявление GPIO пинов
				 * @note  Для совместимости с библиотекой HAL
				 */
				#define GPIO_PIN_0						((uint16_t)0x0001)
				#define GPIO_PIN_1						((uint16_t)0x0002)
				#define GPIO_PIN_2						((uint16_t)0x0004)
				#define GPIO_PIN_3						((uint16_t)0x0008)
				#define GPIO_PIN_4						((uint16_t)0x0010)
				#define GPIO_PIN_5						((uint16_t)0x0020)
				#define GPIO_PIN_6						((uint16_t)0x0040)
				#define GPIO_PIN_7						((uint16_t)0x0080)
				#define GPIO_PIN_8						((uint16_t)0x0100)
				#define GPIO_PIN_9						((uint16_t)0x0200)
				#define GPIO_PIN_10						((uint16_t)0x0400)
				#define GPIO_PIN_11						((uint16_t)0x0800)
				#define GPIO_PIN_12						((uint16_t)0x1000)
				#define GPIO_PIN_13						((uint16_t)0x2000)
				#define GPIO_PIN_14						((uint16_t)0x4000)
				#define GPIO_PIN_15						((uint16_t)0x8000)
				#define GPIO_PIN_ALL					((uint16_t)0xFFFF)

				#define GPIO_PIN_MASK      				(0x0000FFFFU) 			/* PIN mask for assert test */


				/**
				 * @defgroup GPIO_mode GPIO mode
				 * @brief GPIO Configuration Mode
				 *        Elements values convention: 0xX0yz00YZ
				 *           - X  : GPIO mode or EXTI Mode
				 *           - y  : External IT or Event trigger detection
				 *           - z  : IO configuration on External IT or Event
				 *           - Y  : Output type (Push Pull or Open Drain)
				 *           - Z  : IO Direction mode (Input, Output, Alternate or Analog)
				 */
				#define  GPIO_MODE_INPUT                        (0x00000000U)   /*!< Input Floating Mode                   */
				#define  GPIO_MODE_OUTPUT_PP                    (0x00000001U)   /*!< Output Push Pull Mode                 */
				#define  GPIO_MODE_OUTPUT_OD                    (0x00000011U)   /*!< Output Open Drain Mode                */
				#define  GPIO_MODE_AF_PP                        (0x00000002U)   /*!< Alternate Function Push Pull Mode     */
				#define  GPIO_MODE_AF_OD                        (0x00000012U)   /*!< Alternate Function Open Drain Mode    */
				#define  GPIO_MODE_ANALOG                       (0x00000003U)   /*!< Analog Mode  */


				/**
				 * @defgroup GPIO_speed GPIO speed
				 * @brief GPIO Output Maximum frequency
				 */
				#define  GPIO_SPEED_FREQ_LOW      (0x00000000U)  /*!< range up to 2 MHz, please refer to the product datasheet */
				#define  GPIO_SPEED_FREQ_MEDIUM   (0x00000001U)  /*!< range  4 MHz to 10 MHz, please refer to the product datasheet */
				#define  GPIO_SPEED_FREQ_HIGH     (0x00000003U)  /*!< range 10 MHz to 50 MHz, please refer to the product datasheet */


				/**
				 * @defgroup GPIO_pull GPIO pull
				 * @brief GPIO Pull-Up or Pull-Down Activation
				 */
				#define  GPIO_NOPULL        (0x00000000U)   /*!< No Pull-up or Pull-down activation  */
				#define  GPIO_PULLUP        (0x00000001U)   /*!< Pull-up activation                  */
				#define  GPIO_PULLDOWN      (0x00000002U)   /*!< Pull-down activation                */

				/**
				 * @defgroup GPIOEx Alternate function selection
				 *
				 */
				#if defined (STM32F030x6)

					/*------------------------- STM32F030x6---------------------------*/
					/* AF 0 */
					#define GPIO_AF0_EVENTOUT     ((uint8_t)0x00U)  /*!< AF0: EVENTOUT Alternate Function mapping  */
					#define GPIO_AF0_MCO          ((uint8_t)0x00U)  /*!< AF0: MCO Alternate Function mapping       */
					#define GPIO_AF0_SPI1         ((uint8_t)0x00U)  /*!< AF0: SPI1 Alternate Function mapping      */
					#define GPIO_AF0_TIM17        ((uint8_t)0x00U)  /*!< AF0: TIM17 Alternate Function mapping     */
					#define GPIO_AF0_SWDIO        ((uint8_t)0x00U)  /*!< AF0: SWDIO Alternate Function mapping     */
					#define GPIO_AF0_SWCLK        ((uint8_t)0x00U)  /*!< AF0: SWCLK Alternate Function mapping     */
					#define GPIO_AF0_TIM14        ((uint8_t)0x00U)  /*!< AF0: TIM14 Alternate Function mapping     */
					#define GPIO_AF0_USART1       ((uint8_t)0x00U)  /*!< AF0: USART1 Alternate Function mapping    */
					#define GPIO_AF0_IR           ((uint8_t)0x00U)  /*!< AF0: IR Alternate Function mapping        */
					#define GPIO_AF0_TIM3         ((uint8_t)0x00U)  /*!< AF0: TIM3 Alternate Function mapping      */

					/* AF 1 */
					#define GPIO_AF1_TIM3         ((uint8_t)0x01U)  /*!< AF1: TIM3 Alternate Function mapping      */
					#define GPIO_AF1_USART1       ((uint8_t)0x01U)  /*!< AF1: USART1 Alternate Function mapping    */
					#define GPIO_AF1_EVENTOUT     ((uint8_t)0x01U)  /*!< AF1: EVENTOUT Alternate Function mapping  */
					#define GPIO_AF1_I2C1         ((uint8_t)0x01U)  /*!< AF1: I2C1 Alternate Function mapping      */
					#define GPIO_AF1_IR           ((uint8_t)0x01U)  /*!< AF1: IR Alternate Function mapping        */

					/* AF 2 */
					#define GPIO_AF2_TIM1         ((uint8_t)0x02U)  /*!< AF2: TIM1 Alternate Function mapping      */
					#define GPIO_AF2_TIM16        ((uint8_t)0x02U)  /*!< AF2: TIM16 Alternate Function mapping     */
					#define GPIO_AF2_TIM17        ((uint8_t)0x02U)  /*!< AF2: TIM17 Alternate Function mapping     */
					#define GPIO_AF2_EVENTOUT     ((uint8_t)0x02U)  /*!< AF2: EVENTOUT Alternate Function mapping  */

					/* AF 3 */
					#define GPIO_AF3_EVENTOUT     ((uint8_t)0x03U)  /*!< AF3: EVENTOUT Alternate Function mapping  */
					#define GPIO_AF3_I2C1         ((uint8_t)0x03U)  /*!< AF3: I2C1 Alternate Function mapping      */

					/* AF 4 */
					#define GPIO_AF4_TIM14        ((uint8_t)0x04U)  /*!< AF4: TIM14 Alternate Function mapping     */
					#define GPIO_AF4_I2C1         ((uint8_t)0x04U)  /*!< AF4: I2C1 Alternate Function mapping      */

					/* AF 5 */
					#define GPIO_AF5_TIM16        ((uint8_t)0x05U)  /*!< AF5: TIM16 Alternate Function mapping     */
					#define GPIO_AF5_TIM17        ((uint8_t)0x05U)  /*!< AF5: TIM17 Alternate Function mapping     */

