megalloid/STM32F0xx/Drivers/MY/Inc/my_stm32f0xx_gpio.h
					/* AF 6 */
					#define GPIO_AF6_EVENTOUT     ((uint8_t)0x06U)  /*!< AF6: EVENTOUT Alternate Function mapping  */

				#endif /* STM32F042x6 || STM32F048xx */


				#if defined (STM32F070x6)

					/*--------------------------------------- STM32F070x6 ----------------------------------------*/
					/* AF 0 */
					#define GPIO_AF0_EVENTOUT     ((uint8_t)0x00U)  /*!< AF0: EVENTOUT Alternate Function mapping  */
					#define GPIO_AF0_IR           ((uint8_t)0x00U)  /*!< AF0: IR Alternate Function mapping        */
					#define GPIO_AF0_MCO          ((uint8_t)0x00U)  /*!< AF0: MCO Alternate Function mapping       */
					#define GPIO_AF0_SPI1         ((uint8_t)0x00U)  /*!< AF0: SPI1 Alternate Function mapping      */
					#define GPIO_AF0_SWDIO        ((uint8_t)0x00U)  /*!< AF0: SWDIO Alternate Function mapping     */
					#define GPIO_AF0_SWCLK        ((uint8_t)0x00U)  /*!< AF0: SWCLK Alternate Function mapping     */
					#define GPIO_AF0_TIM14        ((uint8_t)0x00U)  /*!< AF0: TIM14 Alternate Function mapping     */
					#define GPIO_AF0_TIM17        ((uint8_t)0x00U)  /*!< AF0: TIM17 Alternate Function mapping     */
					#define GPIO_AF0_USART1       ((uint8_t)0x00U)  /*!< AF0: USART1 Alternate Function mapping    */

					/* AF 1 */
					#define GPIO_AF1_EVENTOUT     ((uint8_t)0x01U)  /*!< AF1: EVENTOUT Alternate Function mapping  */
					#define GPIO_AF1_I2C1         ((uint8_t)0x01U)  /*!< AF1: I2C1 Alternate Function mapping      */
					#define GPIO_AF1_IR           ((uint8_t)0x01U)  /*!< AF1: IR Alternate Function mapping        */
					#define GPIO_AF1_USART1       ((uint8_t)0x01U)  /*!< AF1: USART1 Alternate Function mapping    */
					#define GPIO_AF1_USART2       ((uint8_t)0x01U)  /*!< AF1: USART2 Alternate Function mapping    */
					#define GPIO_AF1_TIM3         ((uint8_t)0x01U)  /*!< AF1: TIM3 Alternate Function mapping      */

					/* AF 2 */
					#define GPIO_AF2_EVENTOUT     ((uint8_t)0x02U)  /*!< AF2: EVENTOUT Alternate Function mapping  */
					#define GPIO_AF2_TIM1         ((uint8_t)0x02U)  /*!< AF2: TIM1 Alternate Function mapping      */
					#define GPIO_AF2_TIM16        ((uint8_t)0x02U)  /*!< AF2: TIM16 Alternate Function mapping     */
					#define GPIO_AF2_TIM17        ((uint8_t)0x02U)  /*!< AF2: TIM17 Alternate Function mapping     */
					#define GPIO_AF2_USB          ((uint8_t)0x02U)  /*!< AF2: USB Alternate Function mapping       */

					/* AF 3 */
					#define GPIO_AF3_EVENTOUT     ((uint8_t)0x03U)  /*!< AF3: EVENTOUT Alternate Function mapping  */
					#define GPIO_AF3_I2C1         ((uint8_t)0x03U)  /*!< AF3: I2C1 Alternate Function mapping      */

					/* AF 4 */
					#define GPIO_AF4_TIM14        ((uint8_t)0x04U)  /*!< AF4: TIM14 Alternate Function mapping     */
					#define GPIO_AF4_I2C1         ((uint8_t)0x04U)  /*!< AF4: I2C1 Alternate Function mapping      */

					/* AF 5 */
					#define GPIO_AF5_MCO          ((uint8_t)0x05U)  /*!< AF5: MCO Alternate Function mapping       */
					#define GPIO_AF5_I2C1         ((uint8_t)0x05U)  /*!< AF5: I2C1 Alternate Function mapping      */
					#define GPIO_AF5_TIM16        ((uint8_t)0x05U)  /*!< AF5: TIM16 Alternate Function mapping     */
					#define GPIO_AF5_TIM17        ((uint8_t)0x05U)  /*!< AF5: TIM17 Alternate Function mapping     */
					#define GPIO_AF5_USB          ((uint8_t)0x05U)  /*!< AF5: USB Alternate Function mapping       */

					/* AF 6 */
					#define GPIO_AF6_EVENTOUT     ((uint8_t)0x06U)  /*!< AF6: EVENTOUT Alternate Function mapping  */

				#endif

			/**
			 * @} MY_GPIO_Defines
			 */


			/**
			 * @defgroup MY_GPIO_Macros
			 * @brief    Библиотечные макросы
			 * @{
			 */
				/**
				 * @defgroup GPIO Get Port Index
				 * @{
				 */

					#if defined(GPIOD) && defined(GPIOE)

						#define GPIO_GET_INDEX(__GPIOx)    (((__GPIOx) == (GPIOA))? 0U :\
															((__GPIOx) == (GPIOB))? 1U :\
															((__GPIOx) == (GPIOC))? 2U :\
															((__GPIOx) == (GPIOD))? 3U :\
															((__GPIOx) == (GPIOE))? 4U : 5U)
					#endif


					#if defined(GPIOD) && !defined(GPIOE)

						#define GPIO_GET_INDEX(__GPIOx)    (((__GPIOx) == (GPIOA))? 0U :\
															((__GPIOx) == (GPIOB))? 1U :\
															((__GPIOx) == (GPIOC))? 2U :\
															((__GPIOx) == (GPIOD))? 3U : 5U)
					#endif


					#if !defined(GPIOD) && defined(GPIOE)

						#define GPIO_GET_INDEX(__GPIOx)    (((__GPIOx) == (GPIOA))? 0U :\
															((__GPIOx) == (GPIOB))? 1U :\
															((__GPIOx) == (GPIOC))? 2U :\
															((__GPIOx) == (GPIOE))? 4U : 5U)
					#endif


					#if !defined(GPIOD) && !defined(GPIOE)

						#define GPIO_GET_INDEX(__GPIOx)    (((__GPIOx) == (GPIOA))? 0U :\
															((__GPIOx) == (GPIOB))? 1U :\
															((__GPIOx) == (GPIOC))? 2U : 5U)
					#endif

					/**
					 * @}
					 */

				/**
				 * @}  MY_GPIO_Macros
				 */


				/**
				 * @defgroup MY_GPIO_Typedefs
				 * @brief    Typedefs для библиотеки
				 * @{
				 */

					/**
					 * @brief  GPIO Bit SET and Bit RESET enumeration
					 */
					typedef enum
					{
						MY_GPIO_Pin_Reset = 0U,
						MY_GPIO_Pin_Set = 1U
					}
					MY_GPIO_PinState;


					/**
					 * @brief   GPIO Init structure definition
					 */
					typedef struct
					{
						uint32_t Pin;       /*!< Specifies the GPIO pins to be configured.
												 This parameter can be any value of @ref GPIO_pins */
						uint32_t Mode;      /*!< Specifies the operating mode for the selected pins.
												 This parameter can be a value of @ref GPIO_mode */
						uint32_t Pull;      /*!< Specifies the Pull-up or Pull-Down activation for the selected pins.
												 This parameter can be a value of @ref GPIO_pull */
						uint32_t Speed;     /*!< Specifies the speed for the selected pins.
												 This parameter can be a value of @ref GPIO_speed */
						uint32_t Alternate; /*!< Peripheral to be connected to the selected pins
												 This parameter can be a value of @ref GPIOEx_Alternate_function_selection */
					}
					MY_GPIO_Init_t;


					/**
					 * @brief GPIO Mode [GPIOx_MODER]
					 */
					typedef enum
					{
						MY_GPIO_Mode_In = 0x00,  				/*!< GPIO пин в режиме Input */
						MY_GPIO_Mode_Out = 0x01, 				/*!< GPIO пин в режиме Output */
						MY_GPIO_Mode_AF = 0x02,  				/*!< GPIO пин в режиме Alternate Function */
						MY_GPIO_Mode_Analog = 0x03,  				/*!< GPIO пин в режиме Analog input/output */
					}
					MY_GPIO_Mode_t;


					/**
					 * @brief GPIO Output type [GPIOx_OTYPER]
					 */
					typedef enum
					{
						MY_GPIO_OType_PP = 0x00, 				/*!< GPIO Output в режиме Push-Pull */
						MY_GPIO_OType_OD = 0x01  				/*!< GPIO Output в режиме Open-Drain */
					}
					MY_GPIO_OType_t;


					/**
					 * @brief  GPIO Speed [GPIOx_OSPEEDR]
					 */
					typedef enum
					{
						MY_GPIO_Speed_Low = 0x00,    		/*!< GPIO Speed Low */
						MY_GPIO_Speed_Medium = 0x01, 		/*!< GPIO Speed Medium */
						MY_GPIO_Speed_High = 0x03    		/*!< GPIO Speed High */
					}
					MY_GPIO_Speed_t;


					/**
					 * @brief GPIO pull resistors [GPIOx_PUPDR]
					 */
					typedef enum
					{
						MY_GPIO_PuPd_NoPull = 0x00, 		/*!< Без подтяжки */
						MY_GPIO_PuPd_Up = 0x01,     		/*!< Подтяжка в режиме pull-up */
						MY_GPIO_PuPd_Down = 0x02    		/*!< Подтяжка в режиме pull-down */
					}
					MY_GPIO_PuPd_t;

				/**
				 * @} MY_GPIO_Typedefs
				 */


				/**
				 * @defgroup MY_GPIO_Functions
				 * @brief    Функции используемые в библиотеке
				 * @{
				 */
					/**
					 * @brief  Инициализация GPIO пинов
					 * @note   Эта функция так же включает тактирование на целевом GPIO-порту
					 * @param  GPIOx: указатель на GPIOx порт который будет инициализироваться
					 * @param  GPIO_Pin: GPIO пин(ы) которые будут инициализироваться. Вы можете перечислить несколько пинов используя | (OR) оператор
					 * @param  GPIO_Mode: Выбирает GPIO режим работы. Может быть выбран из @ref MY_GPIO_Mode_t
					 * @param  GPIO_OType: Выбирает GPIO режим работы Output. Может быть выбран из @ref MY_GPIO_OType_t
					 * @param  GPIO_PuPd: Выбирает GPIO режим подтяжки. Может быть выбран из @ref MY_GPIO_PuPd_t
					 * @param  GPIO_Speed: Выбирает GPIO скорость. Может быть выбран из @ref MY_GPIO_Speed_t
					 * @retval Нет
					 */
					void MY_GPIO_Init(GPIO_TypeDef* 	GPIOx, \
									  uint16_t 			GPIO_Pin, \
									  MY_GPIO_Mode_t 	GPIO_Mode, 		\
									  MY_GPIO_OType_t 	GPIO_OType, 	\
									  MY_GPIO_PuPd_t 	GPIO_PuPd, 		\
									  MY_GPIO_Speed_t 	GPIO_Speed);


					/**
					 * @brief  Initialize the GPIOx peripheral according to the specified parameters in the GPIO_Init.
					 * @param  GPIOx where x can be (A..F) to select the GPIO peripheral for STM32F0 family
					 * @param  GPIO_Init pointer to a GPIO_InitTypeDef structure that contains
					 *         the configuration information for the specified GPIO peripheral.
					 * @retval None
					 */
					void MY_GPIO_StructInit(GPIO_TypeDef* GPIOx, MY_GPIO_Init_t *GPIO_Init);


					/**
					 * @brief  Инициализация GPIO пинов в качестве альтернативной функции
					 * @note   Эта функция так же включает тактирование на целевом GPIO-порту
					 * @param  GPIOx: указатель на GPIOx порт который будет инициализироваться
					 * @param  GPIO_Pin: GPIO пин(ы) которые будут инициализироваться. Вы можете перечислить несколько пинов используя | (OR) оператор
					 * @param  GPIO_OType: Выбирает GPIO режим работы Output. Может быть выбран из @ref MY_GPIO_OType_t
					 * @param  GPIO_PuPd: Выбирает GPIO режим подтяжки. Может быть выбран из @ref MY_GPIO_PuPd_t
					 * @param  GPIO_Speed: Выбирает GPIO скорость. Может быть выбран из @ref MY_GPIO_Speed_t
					 * @param  Alternate: альтернативная функция
					 * @retval Нет
					 */
					void MY_GPIO_InitAlternate(GPIO_TypeDef* 	GPIOx, \
											   uint16_t 	 	GPIO_Pin, 	\
											   MY_GPIO_OType_t 	GPIO_OType, \
											   MY_GPIO_PuPd_t 	GPIO_PuPd, 	\
											   MY_GPIO_Speed_t 	GPIO_Speed, \
											   uint8_t 			Alternate);


					/**
					 * @brief  Деинициализация GPIO-порта
					 * @note   Пины устанавливаются в аналоговый режим для энергосбережения
					 * @param  GPIOx: указатель на GPIOx порт который будет инициализироваться
					 * @param  GPIO_Pin: GPIO пин(ы) которые будут деинициализированы. Вы можете перечислить несколько пинов используя | (OR) оператор
					 * @retval Нет
					 */
					void MY_GPIO_DeInit(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);


					/**
					 * @brief  Включение тактирования на GPIO порт
					 * @note   Эта функция включает тактирование на целевом GPIO-порту.
					 * @param  GPIOx: указатель на GPIOx порт
					 */
					void MY_GPIO_EnableClock(GPIO_TypeDef* GPIOx);


					/**
					 * @brief  Выключение тактирования на GPIO порт
					 * @note   Эта функция выключает тактирование на целевом GPIO-порту.
					 * @param  GPIOx: указатель на GPIOx порт
					 */
					void MY_GPIO_DisableClock(GPIO_TypeDef* GPIOx);


					/**
					 * @brief  Вычисление порядкового номера GPIO-порта
					 * @param  GPIOx: указатель на GPIOx порт
					 * @retval Порядковый номер GPIO-порта
					 */
					uint16_t MY_GPIO_GetPortSource(GPIO_TypeDef* GPIOx);


					/**
					 * @brief  Получаем порядковый номер с желаемого GPIO пина
					 * @note   Предназначен для служебных целей.
					 * @param  GPIO_Pin: GPIO пин для подсчета порядкового номера
					 * @retval Подсчитанный порядковый номер GPIO пина
					 */
					uint16_t MY_GPIO_GetPinSource(uint16_t GPIO_Pin);


					/**
					 * @brief  Устанавливает пин(ы) как вход
					 * @note   Перед использованием функции необходимо предварительно их инициализировать через @ref MY_GPIO_Init() или @ref MY_GPIO_InitAlternate()
					 * @note   Это просто опция для быстрого переключения в режим input
					 * @param  GPIOx: указатель на GPIOx порт в котором будут производиться изменения
					 * @param  GPIO_Pin: GPIO пин(ы) которые будут изменены. Вы можете перечислить несколько пинов используя | (OR) оператор
					 * @retval Нет
					 */
					void MY_GPIO_SetPinAsInput(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);


					/**
					 * @brief  Устанавливает пин(ы) как выход
					 * @note   Перед использованием функции необходимо предварительно их инициализировать через @ref MY_GPIO_Init() или @ref MY_GPIO_InitAlternate()
					 * @note   Это просто опция для быстрого переключения в режим output
					 * @param  GPIOx: указатель на GPIOx порт в котором будут производиться изменения
					 * @param  GPIO_Pin: GPIO пин(ы) которые будут изменены. Вы можете перечислить несколько пинов используя | (OR) оператор
					 * @retval Нет
					 */
					void MY_GPIO_SetPinAsOutput(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);


					/**
					 * @brief  Устанавливает пин(ы) как analog
					 * @note   Перед использованием функции необходимо предварительно их инициализировать через @ref MY_GPIO_Init() или @ref MY_GPIO_InitAlternate()
					 * @note   Это просто опция для быстрого переключения в режим analog
					 * @param  GPIOx: указатель на GPIOx порт в котором будут производиться изменения
					 * @param  GPIO_Pin: GPIO пин(ы) которые будут изменены. Вы можете перечислить несколько пинов используя | (OR) оператор
					 * @retval Нет
					 */
					void MY_GPIO_SetPinAsAnalog(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);


					/**
					 * @brief  Устанавливает пин(ы) как alternate function
					 * @note   Перед использованием функции необходимо предварительно их инициализировать через @ref MY_GPIO_InitAlternate().
					 *            Эта функция используется только для изменения режима GPIO
					 * @param  GPIOx: указатель на GPIOx порт в котором будут производиться изменения
					 * @param  GPIO_Pin: GPIO пин(ы) которые будут изменены. Вы можете перечислить несколько пинов используя | (OR) оператор
					 * @retval Нет
					 */
					void MY_GPIO_SetPinAsAlternate(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);


					/**
					 * @brief  Устанавливает настройки подтяжки в GPIO пинах
					 * @note   Перед использованием функции необходимо предварительно их инициализировать через @ref MY_GPIO_Init() или @ref MY_GPIO_InitAlternate()
					 * @param  GPIOx: указатель на GPIOx порт в котором будут производиться изменения
					 * @param  GPIO_Pin: GPIO пин(ы) которые будут изменены. Вы можете перечислить несколько пинов используя | (OR) оператор
					 * @param  GPIO_PuPd: Выбирает GPIO режим подтяжки. Может быть выбран из @ref MY_GPIO_PuPd_t
					 * @retval Нет
					 */
					void MY_GPIO_SetPullResistor(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, MY_GPIO_PuPd_t GPIO_PuPd);


					/**
					 * @brief  Устанавливает значение GPIO пина в ноль
					 * @note   Объявлен как макрос для получения максимальной скорости выполнения используя атомарную операцию
					 * @param  GPIOx: указатель на GPIOx порт в котором будут производиться изменения
					 * @param  GPIO_Pin: GPIO пин(ы) которые будут изменены. Вы можете перечислить несколько пинов используя | (OR) оператор
					 * @retval Нет
					 */
					#define MY_GPIO_SetPinLow(GPIOx, GPIO_Pin)			((GPIOx)->BSRR = (uint32_t)(((uint32_t)GPIO_Pin) << 16))


					/**
					 * @brief  Устанавливает значение GPIO пина в единицу
					 * @note   Объявлен как макрос для получения максимальной скорости выполнения используя атомарную операцию
					 * @param  GPIOx: указатель на GPIOx порт в котором будут производиться изменения
					 * @param  GPIO_Pin: GPIO пин(ы) которые будут изменены. Вы можете перечислить несколько пинов используя | (OR) оператор
					 * @retval Нет
					 */
					#define MY_GPIO_SetPinHigh(GPIOx, GPIO_Pin)			((GPIOx)->BSRR = (uint32_t)(GPIO_Pin))


					/**
					 * @brief  Устанавливает значение GPIO пина
					 * @note   Объявлен как макрос для получения максимальной скорости выполнения используя прямой доступ к регистрам
					 * @param  GPIOx: указатель на GPIOx порт в котором будут производиться изменения
					 * @param  GPIO_Pin: GPIO пин(ы) которые будут изменены. Вы можете перечислить несколько пинов используя | (OR) оператор
					 * @param  val: если параметр устанавливается в 0 тогда пин устанавливается в low, иначе high
					 * @retval Нет
					 */
					#define MY_GPIO_SetPinValue(GPIOx, GPIO_Pin, val)	((val) ? MY_GPIO_SetPinHigh(GPIOx, GPIO_Pin) : MY_GPIO_SetPinLow(GPIOx, GPIO_Pin))


					/**
					 * @brief  Инвертирует значение пина
					 * @note   Объявлен как макрос для получения максимальной скорости выполнения используя прямой доступ к регистрам
					 * @param  GPIOx: указатель на GPIOx порт в котором будут производиться изменения
					 * @param  GPIO_Pin: GPIO пин(ы) которые будут изменены. Вы можете перечислить несколько пинов используя | (OR) оператор
					 * @retval Нет
					 */
					#define MY_GPIO_TogglePinValue(GPIOx, GPIO_Pin)		((GPIOx)->ODR ^= (GPIO_Pin))


					/**
					 * @brief  Устанавливает значение на ВЕСЬ порт GPIO в виде 32-битного значения
					 * @note   Объявлен как макрос для получения максимальной скорости выполнения используя прямой доступ к регистрам
					 * @param  GPIOx: указатель на GPIOx порт в котором будут производиться изменения
					 * @param  value: значение присваеваемое для GPIO OUTPUT
					 * @retval Нет
					 */
					#define MY_GPIO_SetPortValue(GPIOx, value)			((GPIOx)->ODR = (value))


					/**
					 * @brief  Получаем входные данные с GPIO-пина
					 * @note   Объявлен как макрос для получения максимальной скорости выполнения используя прямой доступ к регистрам
					 * @param  GPIOx: указатель на GPIOx порт из которого будут считываться данные
					 * @param  GPIO_Pin: GPIO пин(ы) в которых будут считывать значение
					 * @retval 1 если значение high, или 0 если low
					 */
					#define MY_GPIO_GetInputPinValue(GPIOx, GPIO_Pin)	(((GPIOx)->IDR & (GPIO_Pin)) == 0 ? 0 : 1)


					/**
					 * @brief  Получаем выходные данные с GPIO-пина
					 * @note   Объявлен как макрос для получения максимальной скорости выполнения используя прямой доступ к регистрам
					 * @param  GPIOx: указатель на GPIOx порт из которого будут считываться данные
					 * @param  GPIO_Pin: GPIO пин(ы) в которых будут считывать значение
					 * @retval 1 если значение high, или 0 если low
					 */
					#define MY_GPIO_GetOutputPinValue(GPIOx, GPIO_Pin)	(((GPIOx)->ODR & (GPIO_Pin)) == 0 ? 0 : 1)


					/**
					 * @brief  Получаем входные данные со ВСЕГО GPIO порта
					 * @note   Объявлен как макрос для получения максимальной скорости выполнения используя прямой доступ к регистрам
					 * @param  GPIOx: указатель на GPIOx порт из которого будут считываться данные
					 * @retval Значение всего регистра INPUT
					 */
					#define MY_GPIO_GetPortInputValue(GPIOx)			((GPIOx)->IDR)


					/**
					 * @brief  Получаем выходные данные со ВСЕГО GPIO порта
					 * @note   Объявлен как макрос для получения максимальной скорости выполнения используя прямой доступ к регистрам
					 * @param  GPIOx: указатель на GPIOx порт из которого будут считываться данные
					 * @retval Значение всего регистра OUTPUT
					 */
					#define MY_GPIO_GetPortOutputValue(GPIOx)			((GPIOx)->ODR)


					/**
					 * @brief  Получает матрицу свободных пинов которые используются и были инициализированы
					 * @param  GPIOx: указатель на GPIOx порт из которого будут считываться данные
					 * @retval Битовые значения матрицы задействованных пинов в GPIO-порту
					 */
					uint16_t MY_GPIO_GetUsedPins(GPIO_TypeDef* GPIOx);


					/**
					 * @brief  Получает матрицу свободных пинов которые не используются и не были инициализированы
					 * @param  GPIOx: указатель на GPIOx порт из которого будут считываться данные
					 * @retval Битовые значения матрицы свободных пинов в GPIO-порту
					 */
					uint16_t MY_GPIO_GetFreePins(GPIO_TypeDef* GPIOx);


					/**
					 * @brief  Блокирует GPIOx регистры пина для последующих изменений
					 * @note   Вы не сможете вносить изменения в конфигурационные регистры пинов GPIO пока MCU не будет перезагружен
					 * @param  GPIOx: указатель на GPIOx порт в котором будут блокироваться регистры
					 * @param  GPIO_Pin: GPIO пин в которо будут блокироваться регистры
					 * @retval Нет
					 */
					MY_Result_t MY_GPIO_Lock(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);


				/**
				 * @} MY_GPIO_Functions
				 */

			/**
			 * @} MY_HAL_GPIO
			 */

		/**
		 * @} MY_STM32F0xx_Libraries
		 */

		/* C++ detection */
		#ifdef __cplusplus
			}
		#endif

	#endif
